package ru.rbt.barsgl.ejbtest;

import org.junit.Ignore;
import org.junit.Test;
import ru.rbt.barsgl.ejbcore.AsyncProcessor;
import ru.rbt.barsgl.ejbcore.mapping.job.CalendarJob;
import ru.rbt.barsgl.ejbtesting.AsyncTestService;
import ru.rbt.barsgl.ejbtesting.job.service.TestingJob3;
import ru.rbt.ejbcore.util.ServerUtils;
import ru.rbt.shared.Assert;

import java.sql.SQLException;
import java.util.Arrays;
import java.util.List;
import java.util.concurrent.TimeUnit;

import static java.lang.String.format;
import static ru.rbt.barsgl.ejbcore.mapping.job.TimerJob.JobState.STOPPED;
import static ru.rbt.barsgl.shared.enums.JobStartupType.AUTO;

/**
 * Created by Ivan Sevastyanov
 */
public class TempTest1 extends AbstractTimerJobIT {

    @Test @Ignore
    public void tst() {
        List<String> users = Arrays.asList(
                "Иванова Наталья Кирилловна;MB11131;OPER"
                ,"Бойко Жанна Владимировна;MB10340;OPER"
                ,"Водзинская Марина Михайловна;MB17686;OPER"
                ,"Башинская Оксана Анатольевна;VOOOBASH;ACC_OPER"
                ,"Чекина Дарья Сергеевна;MB19073;ACC_OPER"
                ,"Мазур Екатерина Васильевна;CASEMAZU;GUEST"
                ,"Теплова Екатерина Валерьевна;CASETEPL;GUEST"
                ,"Герасименко Юлия Валентиновна;CASYGERA;GUEST"
                ,"Тимофеева Ирина Владимировна;CASITIMO;GUEST"
                ,"Лебедева Светлана Александровна;CASSLEBE;GUEST"
                ,"Иванова Зоя Владимировна;mb20220;GUEST"
                ,"Деревкова Наталья Ивановна;CASNDERE;GUEST"
                ,"Еремина Елена Васильевна;CASEEREM;GUEST"
                ,"Симонова Оксана Владимировна;mb13903;GUEST"
                ,"Путинцева Любовь Ивановна;mb12560;GUEST"
                ,"Титова Светлана Дмитриевна;mb20158;GUEST"
                ,"Ловякина Галина Николаевна;CASGLOVY;GUEST"
                ,"Сергеев Яков Данилович;mb22770;GUEST"
                ,"Райкова Елена Викторовна;MB12585;OPER"
                ,"Куранова Наталья Андреевна;MB11661;OPER"
                ,"Елецкая Марина Сергеевна;MB10868;OPER"
                ,"Косарева Людмила Сергеевна;MB19970;OPER"
                ,"Ирикова Людмила Александровна;CRCLIRIK;GUEST"
                ,"Шебалин Владислав Михайлович;MB13617;GUEST"
                ,"Рощина Жанна Анатольевна;MB21834;GUEST"
                ,"Соломина Марина Владимировна;MB22440;GUEST"
                ,"Коперник Анна Юрьевна;MB17216;GUEST"
                ,"Коростелев Максим Андреевич;MB18948;GUEST"
                ,"Маслов Антон Олегович;ER21734;GUEST"
                ,"Грязнова Мария Николаевна;ER21560;GUEST"
                ,"Колосков Андрей Сергеевич;ER21275;GUEST"
                ,"Рымаренко Никита Владимирович;ER20579;GUEST"
                ,"Грдан Светлана Олеговна;MB10723;GUEST"
                ,"Серяк Денис Николаевич;МВ12840;OPER"
                ,"Шевцов Михаил Геннадьевич;МВ13621;OPER"
                ,"Масленникова Елена Витальевна;MB17588;OPER"
                ,"Никулина Наталья Сергеевна;MB12214;OPER"
                ,"Малахова Татьяна Георгиевна;mb11889;ACC_OPER"
                ,"Прохорова Наталья Анатольевна;mb12538;ACC_OPER"
                ,"Ниськова Ирина Александровна;mb22691;ACC_OPER"
                ,"Черемисина Ирина Николаевна;MB13498;OPER"
                ,"Головина Ирина Николаевна;MB21266;OPER"
                ,"Приходько Юлия Владимировна;MB12523;OPER"
                ,"Балашова Ирина Владимировна;MB 10212;OPER"
                ,"Михайлова Татьяна Святославовна;MB 16447;OPER"
                ,"Уварова Татьяна Евгеньевна;MB 13255;OPER"
                ,"Солдатова Наталья Борисовна;MB 12955;OPER"
                ,"Стахурлова Алла Александровна;MB 13006;OPER"
                ,"Уварова Светлана Николаевна;MB 14871;OPER"
                ,"Пислегина Светлана Валерьевна;MB12427;OPER"
                ,"Устинович Ирина Ивановна;MB13290;OPER"
                ,"Литвиненко Жаклина Вадимовна;MB21267;OPER");
        for (String user : users) {
            String[] arr = user.split(";");
            String[] fio = arr[0].split(" ");
            String role = getRole(arr[2]);
            System.out.println(format(
                    "insert into gl_user (user_name, user_pwd, user_role, surname,firstname,patronymic) " +
                            "values ('%s', '%s', '%s','%s', '%s', '%s');"
                    , arr[1], ServerUtils.md5(arr[1]), role, fio[0], fio[1], fio[2]));
        }
    }

    private String getRole(String roleName) {
        if (roleName.equals("ACC_OPER")) {
            return "ACC_OPER";
        } else if (roleName.equals("GUEST")) {
            return "GUEST";
        } else if (roleName.equals("OPER")) {
            return "OPERATION";
        } else {
            throw new RuntimeException("Illegal: " + roleName);
        }
    }

    @Test @Ignore
    public void tst2() {
        remoteAccess.invoke(AsyncTestService.class, "process");
    }

    @Test @Ignore
    public void tst4() throws SQLException {
        final int cnt = 5000;
        remoteAccess.invoke(AsyncTestService.class, "process2", new Integer(cnt));
        remoteAccess.invoke(AsyncProcessor.class, "awaitCompletion", 5, TimeUnit.MINUTES);
        Assert.isTrue(cnt == baseEntityRepository.selectFirst("select count(1) cnt from tmp_test_async").getLong(0));
    }

    @Test @Ignore
    public void tst3() {
        CalendarJob calendarJob = new CalendarJob();
        calendarJob.setDelay(0L);
        calendarJob.setDescription("test calendar job 30");
        calendarJob.setRunnableClass(TestingJob3.class.getName());
        calendarJob.setStartupType(AUTO);
        calendarJob.setState(STOPPED);
        calendarJob.setName(System.currentTimeMillis() + "");
        calendarJob.setScheduleExpression("month=*;second=*/30;minute=*;hour=*");

        calendarJob = (CalendarJob) baseEntityRepository.save(calendarJob);
        registerJob(calendarJob);

        jobService.startupJob(calendarJob);

        jobService.shutdownJob(calendarJob);

        System.out.println("started");
    }

    @Test @Ignore
    public void tst300() {
        List<String> users = Arrays.asList(
                "MB21381;Адаева;Светлана;Игоревна;UFA"
                ,"mb22309;Толмачев;Константин;Александрович;UFA"
                ,"MB20969;Фаридонова;Альбина;Ахметовна;UFA"
                ,"MB18172;Хуснутдинова;Рузиля;Радиковна;UFA"
                ,"MB14799;Браун;Кристина;Ринатовна;UFA"
                ,"mb15637;Ксенофонтова;Ирина;Владимировна;UFA"
                ,"mb21698;Ламшанкина;Елена;Викторовна;UFA"
                ,"mb21717;Ломкова;Татьяна;Владимировна;UFA"
                ,"mb22484;Тимербаева;Светлана;Сергеевна;UFA"
                ,"MB10183;Багаманова;Регина;Камиловна;UFA"
                ,"mb13569;Шадрина;Инесса;Викторовна;UFA"
                ,"mb16562;Зарипова;Алина;Наилевна;UFA"
                ,"mb14314;Чернова;Жанна;Раисовна;UFA"
                ,"MB10341;Бойко;Ксения;Игоревна;VLG"
                ,"MB20513;Лукьянова;Анна;Викторовна;VLG"
                ,"mb23250;Маркелова;Екатерина;Юрьевна;VLG"
                ,"VOOOUvar;Уварова;Ольга;Вячеславовна;VLG"
                ,"mb23031;Ушакова;Екатерина;Сергеевна;VLG"
                ,"mb22628;Плесовских;Владимир;Владимирович;VLG"
                ,"mb14089;Перервенко;Лариса;Геннадьевна;VRN"
                ,"mb22650;Городова;Евгения;Владимировна;VRN"
                ,"mb22154;Красиков;Станислав;Игоревич;VRN"
                ,"MB14277;Клешкова;Екатерина;Юрьевна;VRN"
                ,"MB18911;Мичманова;Надежда;Сергеевна;VRN"
                ,"MB17508;Попова;Алина;Юрьевна;VRN"
                ,"MB17044;Городова;Анастасия;Николаевна;VRN"
                ,"MB13614;Швецова;Юлия;Алексеевна;VRN"
                ,"MB10984;Жеглова;Марина;Александровна;VRN"
                ,"mb22804;Медведева;Марина;Витальевна;VRN"
                ,"MB18195;Сулим;Алина;Николаевна;VRN"
                ,"mb12622;Рогачева;Ольга;Александровна;VRN"
                ,"mb21902;Зайцева;Надежда;Серафимовна;VRN"
                ,"mb13661;Шкатова;Ольга;Александровна;VRN"
                ,"mb22559;Малинин;Денис;Владимирович;VRN"
                ,"mb21692;Хусаинов;Рустам;Радикович;EKB"
                ,"mb15598;Тонких;Ольга;Владимировна;EKB"
                ,"MB14097;Гарайшина;Евгения;Игоревна;EKB"
                ,"MB18211;Кременева;Ирина;Валентиновна;EKB"
                ,"mb18169;Лоскутова;Марина;Николаевна;EKB"
                ,"mb12986;Софьина;Марина;Николаевна;EKB"
                ,"mb23432;Гордина;Юлия;Олеговна;EKB"
                ,"mb14344;Клименко;Наталья;Сергеевна;EKB"
                ,"MB18634;Богданова;Анна;Алексеевна;EKB"
                ,"MB17589;Гассан;Анжелика;Витальевна;EKB"
                ,"mb21995;Пилькевич;Ольга;Сергеевна;EKB"
                ,"MB20326;Сусликова;Варвара;Ринатовна;EKB"
                ,"mb23144;Мартынов;Артем;Валерьевич;EKB"
                ,"mb10434;Бутко;Ирина;Валерьевна;KRS"
                ,"mb22616;Серебренникова;Юлия;Александровна;KRS"
                ,"mb21901;Димитриади;Юрий;Николаевич;KRS"
                ,"MB19982;Мурина;Анна;Ивановна;KRS"
                ,"MB21347;Пасечная;Алена;Сергеевна;KRS"
                ,"mb18038;Ульянова;Ксения;Вячеславовна;KRS"
                ,"mb20330;Барко;Галина;Ивановна;KRS"
                ,"mb23310;Денисенко;Эдуард;Вячеславович;KRS"
                ,"mb15403;Дзюба;Людмила;Александровна;KRS"
                ,"mb23483;Солодова;Анастасия;Юрьевна;KRS"
                ,"mb18116;Измайлова;Валентина;Петровна;KRS"
                ,"mb22166;Степаненко;Инна;Валерьевна;KRS"
                ,"mb23339;Шевченко;Екатерина;Сергеевна;KRS"
                ,"mb22927;Бессонов;Владислав;Сергеевич;KRS"
                ,"MB11710;Ламанов;Иван;Петрович;KRS"
                ,"MB18369;Ельченкова;Вера;Геннадьевна;NNV"
                ,"mb23534;Рогозинская;Татьяна;Владимировна;MOS"
                ,"mb10668;Ильина;Ирина;Сергеевна;MOS"
                ,"ONVMDivl;Дивличарова;Марина;Генаровна;MOS"
                ,"mb22519;Шипилов;Сергей;Вячеславович;NNV"
                ,"mb22953;Смирнова;Мария;Валерьевна;NNV"
                ,"mb22793;Давыденко;Ольга;Геннадьевна;NNV"
                ,"MB20766;Арясова;Юлия;Федоровна;NNV"
                ,"mb22531;Потехина;Екатерина;Николаевна;NNV"
                ,"MB13448;Хрыкина;Екатерина;Александровна;NNV"
                ,"mb22710;Громова;Оксана;Александровна;NNV"
                ,"MB18466;Садырин;Александр;Витальевич;NNV"
                ,"MB19023;Денисова;Евгения;Викторовна;NNV"
                ,"mb23014;Куприянова;Мария;Юрьевна;NNV"
                ,"mb22436;Выговская;Ольга;Владимировна;NNV"
                ,"mb19343;Гарскова;Алёна;Сергеевна;NNV"
                ,"mb14189;Коршунова;Елена;Владимировна;NNV"
                ,"mb22415;Чергикова;Наталья;Сергеевна;NNV"
                ,"mb14849;Адрахманова;Алия;Сергеевна;NNV"
                ,"mb23086;Киселенко;Ксения;Андреевна;NNV"
                ,"mb19677;Лонина;Дарья;Вячеславовна;NNV"
                ,"mb14101;Ягнюк;Марина;Анатольевна;NNV"
                ,"mb13608;Шахмина;Ольга;Викторовна;NNV"
                ,"mb21169;Григорьева;Оксана;Вячеславовна;NVS"
                ,"mb22319;Измалкова;Виктория;Владимировна;NVS"
                ,"MB12247;Марченко;Екатерина;Геннадьевна;NVS"
                ,"mb22587;Погорельцева;Анна;Викторовна;NVS"
                ,"mb22111;Маркин;Николай;Сергеевич;NVS"
                ,"MB14851;Свиридова;Надежда;Владимировна;NVS"
                ,"MB20685;Гурьянова;Алёна;Андреевна;NVS"
                ,"mb21155;Нургалиева;Надежда;Адильевна;NVS"
                ,"mb22806;Гареева;Дина;Амировна;NVS"
                ,"mb23445;Долженкова;Дарья;Николаевна;NVS"
                ,"mb23061;Михалева;Ольга;Викторовна;NVS"
                ,"mb21766;Черемнова;Анастасия;Александровна;NVS"
                ,"mb22114;Воропаева;Татьяна;Николаевна;NVS"
                ,"mb18136;Курочкин;Владимир;Евгеньевич;NVS"
                ,"mb22376;Ларина;Кристина;Евгеньевна;NVS"
                ,"mb22752;Мельниченко;Анна;Ивановна;NVS"
                ,"MB19581;Мозговая;Диана;Сергеевна;NVS"
                ,"mb22241;Мельникова;Юлия;Андреевна;NVS"
                ,"MB18474;Любушкин;Артемий;Михайлович;NVS"
                ,"mb21062;Беляева;Екатерина;Игоревна;NVS"
                ,"mb21532;Малько;Валерия;Сергеевна;NVS"
                ,"MB14899;Пецевич;Ксения;Сергеевна;NVS"
                ,"mb20337;Шаркова;Кристина;Владиславовна;NVS"
                ,"mb16605;Барок;Ольга;Васильевна;NVS"
                ,"mb19145;Косикова;Виктория;Викторовна;PRM"
                ,"mb18801;Плотникова;Анна;Александровна;PRM"
                ,"MB17975;Меньшикова;Татьяна;Евгеньевна;PRM"
                ,"MB20235;Миронова;Елена;Владимировна;PRM"
                ,"MB15713;Вепрева;Юлия;Игоревна;PRM"
                ,"MB15935;Ханьжина;Людмила;Германовна;PRM"
                ,"mb22629;Мерзляков;Владислав;Вячеславович;PRM"
                ,"mb23178;Верещагина;Оксана;Николаевна;PRM"
                ,"mb23270;Ефимова;Анастасия;Алексеевна;PRM"
                ,"mb23435;Ончукова;Ирина;Юрьевна;PRM"
                ,"mb21645;Колесникова;Александра;Валерьевна;SPB"
                ,"mb22421;Кушнир;Виктория;Валерьевна;SPB"
                ,"mb22221;Лунева;Дарья;Александровна;SPB"
                ,"mb17390;Семенова;Алла;Владимировна;SPB"
                ,"MB15945;Гаврилова;Анастасия;Владимировна;SPB"
                ,"MB17816;Минасова;Елена;Игоревна;SPB"
                ,"mb22243;Григорьева;Анна;Андреевна;SPB"
                ,"mb11768;Лешневская;Наталья;Валерьевна;SPB"
                ,"mb22885;Малакшинова;Арюна;Баяровна;SPB"
                ,"mb22220;Смирнова;Елена;Сергеевна;SPB"
                ,"mb22653;Щербинина;Ирина;Игоревна;SPB"
                ,"MB19647;Демидова;Ольга;Викторовна;SPB"
                ,"mb16184;Кокшаров;Станислав;Валерьевич;SPB"
                ,"mb21639;Кроленко;Виктория;Игоревна;SPB"
                ,"MB19114;Стенькина;Наталья;Игоревна;SPB"
                ,"mb16595;Никонов;Сергей;Юрьевич;SPB"
                ,"MB18399;Короткова;Любовь;Александровна;SPB"
                ,"MB19952;Минина;Софья;Вячеславовна;SPB"
                ,"mb21794;Федорова;Светлана;Вадимовна;SPB"
                ,"MB20855;Идрисова;Ксения;Романовна;SPB"
                ,"mb11397;Владимиренко;Галина;Викторовна;SPB"
                ,"MB13497;Бароничева;Татьяна;Михайловна;SPB"
                ,"MB20434;Давыдова;Татьяна;Владимировна;SPB"
                ,"MB20105;Иванова;Юлия;Вячеславовна;SPB"
                ,"MB17757;Кузнецова;Юлия;Николаевна;SPB"
                ,"mb23105;Маменкова;Кристина;Викторовна;SPB"
                ,"mb16597;Шаронова;Анжелика;Михайловна;SPB"
                ,"mb11376;Ковешникова;Дарья;Владимировна;SPB"
                ,"mb14876;Арчвадзе;Анастасия;Александровна;SPB"
                ,"mb23259;Бойцова;Майя;Юрьевна;SPB"
                ,"MB18277;Жук;Наталья;Анатольевна;SPB"
                ,"mb17153;Марова;Дарина;Николаевна;SPB"
                ,"mb22156;Скрыников;Ярослав;Иванович;SPB"
                ,"mb19117;Шаврин;Вадим;Васильевич;SPB"
                ,"MB19022;Шибаков;Александр;Михайлович;SPB"
                ,"MB20234;Мазо;Анна;Борисовна;SPB"
                ,"MB21161;Коканов;Николай;Владимирович;SPB"
                ,"MB20603;Абдрахимова;Елена;Андреевна;SPB"
                ,"MB18338;Тычкина;Ольга;Николаевна;SPB"
                ,"MB14880;Воронова;Анастасия;Игоревна;SPB"
                ,"mb11095;Зубкова;Анна;Евгеньевна;SPB"
                ,"mb22792;Финогеева;Яна;Федоровна;SPB"
                ,"mb18054;Маляров;Михаил;Валерьевич;SPB"
                ,"MB13715;Резанцева;Евгения;Евгеньевна;SPB"
                ,"MB19222;Романов;Антон;Алексеевич;SPB"
                ,"MB12964;Соловьева;Елена;Александровна;SPB"
                ,"mb22522;Трантина;Юлия;Викторовна;SPB"
                ,"MB19182;Тычкин;Владимир;Сергеевич;SPB"
                ,"mb23277;Черная;Мария;Евгеньевна;SPB"
                ,"mb17273;Щербакова;Ирина;Александровна;SPB"
                ,"MB18777;Еременко;Надежда;Олеговна;SPB"
                ,"MB15718;Петина;Юлия;Викторовна;SPB"
                ,"MB13230;Трошина;Татьяна;Геннадьевна;SPB"
                ,"mb23149;Девятилова;Евгения;Сергеевна;SPB"
                ,"MB18355;Ковалева;Евгения;Юрьевна;SPB"
                ,"MB11391;Козина;Юлия;Викторовна;SPB"
                ,"mb20882;Смирнова;Елена;Николаевна;SPB"
                ,"mb22612;Енгибарова;Дарья;Александровна;SPB"
                ,"mb21999;Алиева;Кристина;Нусретдиновна;SPB"
                ,"mb22340;Бадиж;Екатерина;Евгеньевна;SPB"
                ,"MB19618;Игнатьева;Ирина;Михайловна;SPB"
                ,"MB18898;Приходько;Дарья;Александровна;SPB"
                ,"mb12573;Пьянкова;Людмила;Сергеевна;SPB"
                ,"MB19890;Алференков;Евгений;Вячеславович;SPB"
                ,"MB12391;Петрова;Анастасия;Игоревна;SPB"
                ,"mb23127;Гацанюк;Олег;Анатольевич;SPB"
                ,"MB10750;Груздева;Елена;Юрьевна;SPB"
                ,"MB11563;Кремнева;Оксана;Геннадьевна;SPB"
                ,"MB18459;Лосева;Юлия;Сергеевна;SPB"
                ,"MB19260;Рогожкин;Виталий;Геннадьевич;SPB"
                ,"MB13525;Черткова;Татьяна;Валентиновна;SPB"
                ,"MB11050;Захарова;Елена;Алексеевна;SPB"
                ,"mb10145;Арбузова;Ирина;Алексеевна;SPB"
                ,"MB20021;Банников;Евгений;Станиславович;SPB"
                ,"MB14038;Власова;Любовь;Николаевна;SPB"
                ,"MB18798;Волкова;Екатерина;Юрьевна;SPB"
                ,"mb17327;Мерзликина;Ксения;Борисовна;SPB"
                ,"mb22540;Пак;Ирина;Ивановна;SPB"
                ,"MB12404;Петухов;Сергей;Александрович;SPB"
                ,"MB16115;Петрова;София;Анатольевна;SPB"
                ,"MB21082;Конвенская;Марина;Сергеевна;SPB"
                ,"MB10513;Веселова;Светлана;Алексеевна;SPB"
                ,"MB18857;Гречаная;Наталья;Вадимовна;SPB"
                ,"mb22346;Жулдыбина;Ирина;Робертовна;SPB"
                ,"MB18636;Тараскина;Виктория;Игоревна;SPB"
                ,"MB20572;Торопова;Мария;Олеговна;SPB"
                ,"mb21844;Шахова;Елена;Вячеславовна;SPB"
                ,"MB16657;Иванников;Алексей;Андреевич;SPB"
                ,"MB20250;Красильникова;Любовь;Андреевна;SPB"
                ,"mb12361;Пахомова;Ирина;Александровна;SPB"
                ,"mb15090;Белонович;Дарья;Алексеевна;SPB"
                ,"mb13549;Читчиян;Давид;Гарриевич;SPB"
                ,"mb23166;Завидович;Виктория;Васильевна;SPB"
                ,"mb21336;Киевская;Юлия;Александровна;SPB"
                ,"mb22416;Майзерова;Юлия;Анатольевна;SPB"
                ,"mb12410;Пивень;Александр;Сергеевич;SPB"
                ,"mb14049;Зотикова;Дарья;Борисовна;SPB"
                ,"mb22888;Иванова;Алина;Алексеевна;SPB"
                ,"mb11443;Ракитина;Екатерина;Александровна;SPB"
                ,"mb21998;Кравченко;Екатерина;Физулиевна;SPB"
                ,"mb13164;Тимофеева;Елизавета;Александровна;SPB"
                ,"mb17303;Зашихина;Елена;Леонидовна;NNV"
                ,"mb22925;Каменских;Ирина;Николаевна;NNV"
                ,"mb21004;Шошина;Дарья;Александровна;NNV"
                ,"mb23200;Конкина;Виктория;Олеговна;CHL"
                ,"mb22784;Жабко;Анна;Григорьевна;SPB"
                ,"mb14874;Нуртдинова;Татьяна;Евгеньевна;SPB"
                ,"mb16930;Каракешишян;Любовь;Геннадьевна;SPB"
                ,"mb21860;Данова;Светлана;Анатольевна;RND"
                ,"mb22268;Кастальева;Ирина;Александровна;NVS"
                ,"mb22267;Сочнева;Светлана;Васильевна;NVS"
                ,"MB14209;Лизнева;Екатерина;Геннадьевна;VRN"
                ,"mb20995;Власов;Василий;Юрьевич;CHL"
                ,"MB15696;Васюкова;Татьяна;Юрьевна;SPB"
                ,"mb16561;Владимирова;Наталья;Васильевна;KRS"
                ,"mb23291;Кадушкина;Дарья;Олеговна;KRS"
                ,"mb22892;Дунаева;Ирина;Романовна;KRS"
                ,"mb23257;Михайлова;Майя;Анатольевна;KRS"
                ,"mb23417;Ремеско;Вадим;Леонидович;KRS"
                ,"MB19123;Ионова;Евгения;Владимировна;NNV"
                ,"mb22753;Серебрякова;Ирина;Александровна;NVS"
                ,"mb22707;Черкасова;Ирина;Сергеевна;NVS"
                ,"mb22045;Шпирная;Юлия;Александровна;NVS"
                ,"MB16995;Просвирнова;Александра;Олеговна;PRM"
                ,"mb12422;Горчакова;Анастасия;Михайловна;PRM"
                ,"mb23461;Ничкова;Ирина;Александровна;PRM"
                ,"MB19985;Резбаева;Алиса;Бок-Суровна;PRM"
                ,"mb23121;Суряднова;Марина;Александровна;PRM"
                ,"mb23135;Бичурин;Тимур;Фаритович;SPB"
                ,"MB12981;Сотников;Игорь;Викторович;STV"
                ,"MB11029;Загородний;Василий;Николаевич;STV"
                ,"MB10088;Алтунина;Татьяна;Николаевна;RND"
                ,"mb23179;Бондаренко;Оксана;Викторовна;RND"
                ,"MB21501;Васильченко;Юлия;Анатольевна;RND"
                ,"mb17995;Кучинский;Алексей;Игоревич;RND"
                ,"mb21051;Чернобай;Александр;Геннадьевич;RND"
                ,"mb15693;Рощин;Сергей;Иванович;RND"
                ,"mb12305;Осокина;Юлия;Александровна;RND"
                ,"MB18825;Мажуга;Екатерина;Олеговна;RND"
                ,"mb19728;Семенцова;Анастасия;Николаевна;RND"
                ,"mb11646;Харламова;Анастасия;Викторовна;RND"
                ,"mb22751;Юрчак;Инна;Константиновна;RND"
                ,"mb10892;Дуб;Петр;Леонидович;RND"
                ,"mb12817;Сергань;Мария;Сергеевна;RND"
                ,"MB10125;Журавлева;Анна;Николаевна;SAM"
                ,"mb21481;Иванова;Татьяна;Александровна;SAM"
                ,"mb15587;Иноземцева;Нелли;Владимировна;SAM"
                ,"MB12534;Проскурина;Ольга;Александровна;SAM"
                ,"MB11939;Мартынова;Марина;Владимировна;SAM"
                ,"MB17020;Миронов;Михаил;Валерьевич;SAM"
                ,"mb22812;Нечаева;Алина;Витальевна;SAM"
                ,"MB18152;Пантюхина;Евгения;Олеговна;SAM"
                ,"MB15591;Ефимова;Елена;Валерьевна;SAM"
                ,"mb22720;Махотина;Елена;Александровна;SAM"
                ,"MB11858;Мак;Сергей;Викторович;STV"
                ,"MB19632;Писаренко;Алексей;Анатольевич;STV"
                ,"mb16486;Умрихин;Юрий;Сергеевич;STV"
                ,"MB20058;Чухаенко;Максим;Вячеславович;STV"
                ,"MB11709;Лазарев;Денис;Викторович;STV"
                ,"mb20190;Колобанова;Марина;Николаевна;CHL"
                ,"mb11437;Кондаурова;Ирина;Витальевна;CHL"
                ,"mb22305;Сергеева;Вера;Владимировна;CHL"
                ,"mb21201;Астафьева;Марина;Николаевна;CHL"
                ,"mb10635;Гребенщикова;Анастасия;Дамировна;CHL"
                ,"mb16952;Гурина;Татьяна;Александровна;CHL"
                ,"mb12157;Патракова;Ольга;Владимировна;CHL"
                ,"mb15555;Цыплаков;Дмитрий;Игоревич;CHL"
                ,"mb12237;Носкова;Агата;Юрьевна;CHL"
                ,"mb13502;Черепанов;Виталий;Ильич;CHL"
                ,"mb11718;Губанова;Светлана;Юрьевна;CHL"
                ,"mb22276;Лапшина;Оксана;Сергеевна;CHL"
                ,"mb22964;Мучкина;Наталья;Викторовна;CHL"
                ,"mb18980;Шикунова;Екатерина;Олеговна;CHL"
                ,"mb21459;Юлфаризова;Юлия;Руслановна;CHL"
                ,"mb10177;Аюпов;Павел;Владимирович;CHL"
                ,"mb12788;Севрюгин;Артем;Игоревич;CHL"
                ,"mb21809;Караванцева;Ирина;Евгеньевна;CHL"
                ,"mb19284;Трифонова;Лариса;Ивановна;CHL"
                ,"mb22748;Шамсиярова;Эльвира;Данисовна;CHL"
                ,"mb22906;Тупота;Екатерина;Сергеевна;CHL"
                ,"mb10535;Внукова;Ирина;Александровна;CHL"
        );
        System.out.println(
            "insert into GL_USERTMP2 (USER_NAME,USER_PWD,SURNAME,FIRSTNAME,PATRONYMIC,FILIAL,DEPID,HEADBRANCH,SOURCE,BACKVALUE) values");
        for (String user : users) {
            String[] arr = user.split(";");
            System.out.println(format(
                    " ,('%s', '%s', '%s','%s', '%s', '%s',null,'%s','*','0')"
                    , arr[0], ServerUtils.md5(arr[0]), arr[1], arr[2], arr[3], arr[4], arr[4] ));
        }
    }
}

